<<<<<<< HEAD
// 단항 연산자
// 할당 연산자
// 3항 연산자

let a = 10;
//두개 다 1을 증가시키는 것
a++ // (선할당 후증가)
++a // (선증가 후할당)

// ++의 방향 바꾸셔도 달라지지 않는다.
for(let i = 0; i < 10; i++){
    console.log(i)
}

// 할당 연산자
a = 10
a += 5
a /= 5

// 3항 연산자
// 조건식 ? 조건식이 참일때 실행될 코드 : 
// 조건식이 거짓일때 실행될 코드
=======
// 단항 연산자
// 할당 연산자
// 3항 연산자

let a = 10;
//두개 다 1을 증가시키는 것
a++ // (선할당 후증가)
++a // (선증가 후할당)

// ++의 방향 바꾸셔도 달라지지 않는다.
for(let i = 0; i < 10; i++){
    console.log(i)
}

// 할당 연산자
a = 10
a += 5
a /= 5

// 3항 연산자
// 조건식 ? 조건식이 참일때 실행될 코드 : 
// 조건식이 거짓일때 실행될 코드
>>>>>>> 0d587b90edefd2af0c5188e128276f15d7c635a8
